# Data Cleaning 4

---
> Objective: 
 - Clean the data in res_detail to get an appropriate property features in terms of number of bedrooms and bathrooms(half bathroom to be counted as 1/2 full bathroom)
 - Clean the data in account_info to get a full address of the listed properties

In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import plotly.express as px
import hvplot.pandas
import numpy as np

In [64]:
# import csv files
df_res = pd.read_csv('./Resources/res_detail_new.csv')
df_info = pd.read_csv('./Resources/account_info_new.csv')

In [7]:
df_res.head()

,ACCOUNT_NUM,ACT_AGE,TOT_LIVING_AREA_SF,NUM_FULL_BATHS,NUM_HALF_BATHS,NUM_BEDROOMS
0,00000244603000000,68,1628,1,1,3
1,00000244873000000,72,1965,2,0,3
2,00000244975000000,72,2519,3,0,3
3,00000245347000000,68,2112,2,0,3
4,00000244600000000,69,1272,1,0,2

In [8]:
df_res.columns

Index(['ACCOUNT_NUM', 'ACT_AGE', 'TOT_LIVING_AREA_SF', 'NUM_FULL_BATHS',
       'NUM_HALF_BATHS', 'NUM_BEDROOMS'],
      dtype='object')

In [9]:
# set values in 'num_half_baths' as 1/2 of full_baths each
df_res['NUM_HALF_BATHS'] = df_res['NUM_HALF_BATHS'] / 2

In [19]:
# create a new column 'NUM_BATHS' in which concatenates number of bedrooms(full + half) and drop the original columns
df_res['NUM_BATHS'] = df_res['NUM_FULL_BATHS'] + df_res['NUM_HALF_BATHS']
df_res.drop(columns = ['NUM_FULL_BATHS', 'NUM_HALF_BATHS']).head()

         ACCOUNT_NUM  ACT_AGE  TOT_LIVING_AREA_SF  NUM_BEDROOMS  NUM_BATHS
0  00000244603000000       68                1628             3        1.5
1  00000244873000000       72                1965             3        2.0
2  00000244975000000       72                2519             3        3.0
3  00000245347000000       68                2112             3        2.0
4  00000244600000000       69                1272             2        1.0

In [46]:
# export a new csv files to Resources folder
df_res.to_csv('./Resources/account_info_final.csv')

In [65]:
df_info.dtypes

ACCOUNT_NUM          object
STREET_NUM            int64
FULL_STREET_NAME     object
BLDG_ID              object
UNIT_ID              object
PROPERTY_CITY        object
PROPERTY_ZIPCODE    float64
dtype: object

In [66]:
# Change data types to string
df_info['STREET_NUM'] = df_info['STREET_NUM'].astype('str')
df_info['PROPERTY_ZIPCODE'] = df_info['PROPERTY_ZIPCODE'].astype('str')
df_info.dtypes

ACCOUNT_NUM         object
STREET_NUM          object
FULL_STREET_NAME    object
BLDG_ID             object
UNIT_ID             object
PROPERTY_CITY       object
PROPERTY_ZIPCODE    object
dtype: object

In [68]:
# remove decimal points in 'PROPERTY_ZIPCODE'
df_info['PROPERTY_ZIPCODE'] = df_info['PROPERTY_ZIPCODE'].apply(lambda x: x.split('.')[0])
df_info.tail()

,ACCOUNT_NUM,STREET_NUM,FULL_STREET_NAME,BLDG_ID,UNIT_ID,PROPERTY_CITY,PROPERTY_ZIPCODE
839987,00000511876000000,3921,OVERTON CT,NaN,NaN,DALLAS,75216
839988,00000515854000000,5611,MEADOWICK LN,NaN,NaN,DALLAS,752271525
839989,00000515881000000,5606,MEADOWICK LN,NaN,NaN,DALLAS,752271524
839990,00000516454500000,5633,EMROSE TERRACE,NaN,NaN,DALLAS,752272952
839991,00000518437000000,9735,BLUFF DALE DR,NaN,NaN,DALLAS,752182141

In [69]:
df_info.columns

Index(['ACCOUNT_NUM', 'STREET_NUM', 'FULL_STREET_NAME', 'BLDG_ID', 'UNIT_ID',
       'PROPERTY_CITY', 'PROPERTY_ZIPCODE'],
      dtype='object')

In [71]:
# create a new column 'ADDRESS' that contains a full address from all columns
df_info['ADDRESS'] =  df_info['STREET_NUM'] + " " + df_info['FULL_STREET_NAME'] + ", " + df_info['PROPERTY_CITY']+ ", " + df_info['PROPERTY_ZIPCODE']
df_info.tail()

,ACCOUNT_NUM,STREET_NUM,FULL_STREET_NAME,BLDG_ID,UNIT_ID,PROPERTY_CITY,PROPERTY_ZIPCODE,ADDRESS
839987,00000511876000000,3921,OVERTON CT,NaN,NaN,DALLAS,75216,"3921 OVERTON CT, DALLAS, 75216"
839988,00000515854000000,5611,MEADOWICK LN,NaN,NaN,DALLAS,752271525,"5611 MEADOWICK LN, DALLAS, 752271525"
839989,00000515881000000,5606,MEADOWICK LN,NaN,NaN,DALLAS,752271524,"5606 MEADOWICK LN, DALLAS, 752271524"
839990,00000516454500000,5633,EMROSE TERRACE,NaN,NaN,DALLAS,752272952,"5633 EMROSE TERRACE , DALLAS, 752272952"
839991,00000518437000000,9735,BLUFF DALE DR,NaN,NaN,DALLAS,752182141,"9735 BLUFF DALE DR, DALLAS, 752182141"

In [72]:
df_info.head()

,ACCOUNT_NUM,STREET_NUM,FULL_STREET_NAME,BLDG_ID,UNIT_ID,PROPERTY_CITY,PROPERTY_ZIPCODE,ADDRESS
0,99200006100217400,54325,LEASED EQUIPMENT,NaN,NaN,NaN,nan,NaN
1,99821070000050500,34000,LEASED EQUIPMENT,NaN,NaN,NaN,nan,NaN
2,99860020000719950,51000,LEASED EQUIPMENT,NaN,NaN,NaN,nan,NaN
3,99860020000743650,72200,LEASED EQUIPMENT,NaN,NaN,NaN,nan,NaN
4,99980280000102350,22175,LEASED EQUIPMENT,NaN,NaN,NaN,nan,NaN

In [74]:
# slice necessary columns only
df_info = df_info[['ACCOUNT_NUM', 'ADDRESS']]
df_info.head()

         ACCOUNT_NUM ADDRESS
0  99200006100217400     NaN
1  99821070000050500     NaN
2  99860020000719950     NaN
3  99860020000743650     NaN
4  99980280000102350     NaN

In [75]:
# export a new csv files to Resources folder
df_info.to_csv('./Resources/address.csv')